
[
    {
    "url": "https://www.linkedin.com/jobs/view/4073552631?lg=en",
    "job_title": "Frontend Developer",
    "company_name": "Google",
    "job_location": "İstanbul",
    "job_summary": "This is a unique opportunity to join an exciting early-stage startup experiencing hypergrowth in a white-hot segment of the cybersecurity space. Cycode is a fast-growing cybersecurity startup and the creator of the first comprehensive software supply chain security solution. As software supply chain attacks rise sharply, Cycode’s platform delivers complete visibility, security, and integrity across all stages of the software development lifecycle (SDLC), helping companies protect against high-profile threats. Founded in 2019, Cycode is backed by YL Ventures and Insight Partners and has received significant industry recognition, including Cyber Defense Magazine's Top Infosec Innovator (2023) and multiple other awards in recent years. As a Data Engineer at Cycode, you will play a pivotal role in shaping our evolving data culture. You will be responsible for collecting, organizing, and analyzing data to provide valuable insights that drive informed decision-making across the organization. This is an opportunity to join a dynamic team and contribute to the development of data-driven solutions that drive business growth and innovation. If you are passionate about data and thrive in a collaborative environment, we encourage you to apply. Responsibilities Collect and gather data from various sources, both internal and external. Organize and clean datasets to ensure accuracy and reliability. Utilize appropriate tools and software to analyze and visualize data effectively. Collaborate with cross-functional teams to identify data needs and requirements. Develop and implement data collection strategies to support business objectives. Interpret data and provide insights to inform decision-making processes. Create reports and presentations to communicate findings and recommendations. Assist in the development of data-driven solutions to address business challenges. Stay updated on industry trends and best practices in data analysis. Requirements: Bachelor's degree in a relevant field such as Statistics, Mathematics, Computer Science, or Economics. Strong analytical skills with the ability to collect, organize, and interpret large datasets. Proven experience in building, deploying, and monitoring of ETLs Proficiency in data analysis tools such as SQL, Python, Pandas, Apache Spark / Beam, etc Good understanding of data modeling principles Familiarity with data visualization tools such as Tableau, Power BI, or Google Data Studio. Excellent communication and collaboration skills. Ability to work independently and prioritize tasks effectively. Problem-solving mindset with a keen attention to detail. Experience in a data-related role is preferred but not required. Eagerness to learn and adapt to new technologies and methodologies. Advantages MongoDB AWS Cloud CICD, Docker Kubernetes Show more Show less",
    "talents": "React, NodeJS, SQL"
    }
]